app/controllers/api/v1/arts_controller.rb

  def index
    @arts = Art.all
---
SELECT "arts".* FROM "arts"