app/controllers/api/v1/galleries_controller.rb

SELECT "galleries".* FROM "galleries"
---
  def index
    @galleries = Gallery.all

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @gallery = Gallery.find(params[:id])