app/controllers/login_controller.rb

  def login
    @user = User.find_or_create_by(open_id: wechat_user.fetch("openid"))
---
INSERT INTO "users" ("open_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["open_id", "oeGvi5GagIoofCrp-v-ZY-gX6J60"], ["created_at", "2018-12-06 10:03:39.218631"], ["updated_at", "2018-12-06 10:03:39.218631"]]
SELECT  "users".* FROM "users" WHERE "users"."open_id" = $1 LIMIT $2  [["open_id", "oeGvi5GagIoofCrp-v-ZY-gX6J60"], ["LIMIT", 1]]